src/cf/InformationRegisters/CRM_Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_Напоминания</Name>
			<Comment>Данный регистр предназначен для реализации механизма напоминаний. Напоминание - сообщение которое может быть выведено на экран любому пользователю конфигурации единожды либо с заданной регулярностью.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой напоминание считается актуальным. Не актуальные напоминания удаляются.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание напоминания - сообщение содержащее суть напоминания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Comment>Содержит число, показывающее, сколько раз напоминание было отложено</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СрокОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПериодичностьОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Получатель  напоминания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Ссылка на объект конфигурации прилагаемый к напоминанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата напоминания (для нового равно дате оповещения)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Comment>Дата напоминания +  отсрочка (срок на который пользователь отложил напоминание)  </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_Напоминания/Forms/ФормаЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Вычисляет значение даты актуальности.
//
Процедура ЗаписатьДатуКонца()
	Если Запись.ДатаНачала = Дата("00010101") Тогда
		Запись.ДатаНачала = ТекущаяДата();
	КонецЕсли; 
	Если ТипСрока = 0 Тогда 
		Запись.ДатаАктуальности = Дата("00010101");
	ИначеЕсли ТипСрока = 1 Тогда 
		Запись.ДатаАктуальности = Дата("00010101");
		Если КонецПериода = 0 Тогда Возврат; КонецЕсли;
		Список = Элементы.ВидПериода.СписокВыбора;
		Элемент = Список.НайтиПоЗначению(ВидПериода);
		Если Элемент = Неопределено Тогда Возврат; КонецЕсли;	
		Индекс = Список.Индекс(Элемент);
		Если Индекс = 0 Тогда // Минут
			Запись.ДатаАктуальности = Запись.ДатаНачала + 60 * КонецПериода;
		ИначеЕсли Индекс = 1 Тогда // Часов
			Запись.ДатаАктуальности = Запись.ДатаНачала + 3600 * КонецПериода;
		ИначеЕсли Индекс = 2 Тогда // Дней
			Запись.ДатаАктуальности = Запись.ДатаНачала + 86400 * КонецПериода;
		ИначеЕсли Индекс = 3 Тогда // Недель
			Итератор = 604800;
			Запись.ДатаАктуальности = Запись.ДатаНачала + 604800 * КонецПериода;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры // ЗаписатьДатуКонца()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ОсновныеДействияФормыДействиеЗавершить(Кнопка)
	Закрыть();
	Оповестить("ОбновитьНапоминания");
КонецПроцедуры  

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ

&НаКлиенте
Процедура ПереключательЗавершениеПриИзменении(Элемент = Неопределено)
//	Если ТипСрока > 0 Тогда
	//	Элементы.ПанельЗавершение.Видимость = Истина;
		Элементы.ПанельЗавершение.ТекущаяСтраница = Элементы.ПанельЗавершение.ПодчиненныеЭлементы[ТипСрока];
	//Иначе 
	//	Элементы.ПанельЗавершение.Видимость = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДатаНачала	= ВыбранноеЗначение;
	Запись.ДатаНачала = НачалоДня(ДатаНачала) + (ВремяНачала - Дата('00010101'));
КонецПроцедуры

&НаКлиенте
Процедура ПолеВремяНачалаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если (ВремяНачала = Дата('00010101')) И (Направление = -1) Тогда
		ВремяНачала = Дата('00010101235959');
	Иначе	
		ВремяНачала = ВремяНачала + 60 * Направление;
	КонецЕсли;
	
	Запись.ДатаНачала = НачалоДня(ДатаНачала) + (ВремяНачала - Дата('00010101'));
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = РеквизитФормыВЗначение("Запись");
	
	Если Объект.Выбран() Тогда Возврат; КонецЕсли;
	
	Если Параметры.Свойство("КопируемоеНапоминание") Тогда
		// Заполним напоминание по копируемому.
		ЗаполнитьЗначенияСвойств(Запись, Параметры.КопируемоеНапоминание);
		Запись.ДатаОповещения	= Дата('00010101');
		Запись.Счетчик			= 0;
	Иначе
		Запись.Важность	= Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	КонецЕсли;
	
	Если Параметры.Свойство("Содержание") Тогда
		Запись.Содержание = Параметры.Содержание;
	КонецЕсли;
	
	Если Параметры.Свойство("Предмет") Тогда
		Запись.Предмет = Параметры.Предмет;
	КонецЕсли;
	
	// +++ VOG Кулаков П.Л. 25.12.2020 DEV-46
	Если Параметры.Свойство("ВидОповещения") Тогда
		Запись.ВидОповещения = Параметры.ВидОповещения;
	КонецЕсли;
	// --- VOG Кулаков П.Л.
	
	Запись.ДатаНачала	= ТекущаяДатаСеанса();
	Запись.Пользователь	= Пользователи.ТекущийПользователь();
	
	// Скроем служебную информацию.
	Элементы.ГруппаДат.Видимость = Ложь;
	
	ВидПериода = Элементы.ВидПериода.СписокВыбора[2];
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
		ДатаНачала	= Запись.ДатаНачала; 
		ВремяНачала	= Запись.ДатаНачала;
	КонецЕсли;
	Если Запись.Счетчик > 0 Тогда
		ДвеПоследниеЦифры = Запись.Счетчик % 100;
		ПоследняяЦифра = Запись.Счетчик % 10;
		Окончание = "";
		Если ДвеПоследниеЦифры < 5 Или ДвеПоследниеЦифры > 21 Тогда
			Если ПоследняяЦифра > 1 И ПоследняяЦифра < 5 Тогда
				Окончание = "а";
			КонецЕсли;
		КонецЕсли;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Напоминание (отложено %1 раз %2)'"),
						Запись.Счетчик, Окончание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьДатуКонца();
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Запись.ДатаНачала = ТекущаяДата();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.ДатаОповещения) Тогда
		Запись.ДатаОповещения	= Запись.ДатаНачала;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьНапоминания");
КонецПроцедуры

&НаКлиенте
Процедура ПолеВремяНачалаПриИзменении(Элемент)
	
	Запись.ДатаНачала = НачалоДня(ДатаНачала) + (ВремяНачала - Дата('00010101'));
	
КонецПроцедуры

#КонецОбласти
